:PROPERTIES:
:CATEGORY: watch-later
:END:
* TODO [5/7] Integration tests
:LOGBOOK:
CLOCK: [2021-02-28 Sun 01:01]--[2021-02-28 Sun 01:06] =>  0:05
CLOCK: [2021-02-27 Sat 23:09]--[2021-02-28 Sun 00:59] =>  1:50
:END:
- [-] add
  - [X] normal
  - [ ] add from playlist
  - [ ] add from playlist, removing videos from playlist
- [X] list
- [X] mark-watched
- [-] playlist
  - [ ] append
  - [ ] dedup
  - [X] list
  - [ ] remove
- [X] remove
- [X] stats
- [X] watch

Playlist-editing tests probably need to be based on creating a new
playlist, editing it, and then deleting it.

Or, perhaps, I should just log the requests and mock out the
responses.  Seems less likely to make YouTube upset.
* NOTDONE Plain text format
CLOSED: [2021-08-15 Sun 17:15]
* DONE Batch YouTube API requests
CLOSED: [2021-02-16 Tue 00:00]
:LOGBOOK:
CLOCK: [2021-02-15 Mon 22:45]--[2021-02-16 Tue 00:00] =>  1:15
CLOCK: [2021-02-09 Tue 22:05]--[2021-02-09 Tue 23:00] =>  0:55
:END:
* DONE Separate table for channel id -> channel name mapping
CLOSED: [2021-01-24 Sun 16:30]
* TODO Store JSON as blob for easy migrations and extensions
* TODO Record timestamp when video is added/watched
- https://changelog.com/posts/you-might-as-well-timestamp-it
* DONE Use Caqti_async as database library
CLOSED: [2021-01-24 Sun 02:49]
:LOGBOOK:
CLOCK: [2021-01-22 Fri 16:15]--[2021-01-22 Fri 19:03] =>  2:48
:END:
[[https://paurkedal.github.io/ocaml-caqti/caqti-async/Caqti_async/module-type-CONNECTION/index.html][Caqti_async.Connection]] supports transactions and async operations.
* DONE Automatically refresh OAuth token when necessary
CLOSED: [2021-01-22 Fri 19:05]
* TODO Add custom user tags to database
Could be used as individual sublists to watch later
* DONE Set journaling mode to WAL
CLOSED: [2021-02-18 Thu 00:49]
* DONE Auto-generate schema file
CLOSED: [2021-02-18 Thu 00:29]
:LOGBOOK:
CLOCK: [2021-02-17 Wed 23:41]--[2021-02-18 Thu 00:29] =>  0:48
:END:
* TODO ETag-based caching
https://developers.google.com/youtube/v3/getting-started#etags
* TODO Only fetch partial JSON resource
https://developers.google.com/youtube/v3/getting-started#partial
* TODO Retry on error 503
[2022-07-24 Sun 18:35]
* TODO Surface original exception from user-defined function
[2022-11-25 Fri 22:20]

The following error doesn't contain the underlying exception, AFAICT.

#+begin_example
  (monitor.ml.Error
   "Response from <sqlite3:/home/aaron/.local/share/watch-later/watch-later.db?busy_timeout=10000> failed: OCaml callback raised an exception. Query: \"\\nSELECT channel_id, channel_title, video_id, video_title, watched FROM videos_all\\nWHERE (?1 IS NULL OR channel_id = ?1)\\n  AND (?2 IS NULL OR channel_title REGEXP ?2)\\n  AND (?3 IS NULL OR video_id = ?3)\\n  AND (?4 IS NULL OR video_title REGEXP ?4)\\n  AND (?5 IS NULL OR watched IS TRUE = ?5 IS TRUE)\\n\"."
   ("Raised at Base__Error.raise in file \"src/error.ml\" (inlined), line 9, characters 14-30"
    "Called from Base__Or_error.ok_exn in file \"src/or_error.ml\", line 92, characters 17-32"
    "Called from Async_kernel__Deferred1.M.map.(fun) in file \"src/deferred1.ml\", line 17, characters 40-45"
    "Called from Async_kernel__Job_queue.run_jobs in file \"src/job_queue.ml\", line 167, characters 6-47"
    "Caught by monitor with_txn at file \"src/video_db.ml\", line 18, characters 76-76"))
#+end_example
* TODO: wl list should show UTF-8 chars
* FIXED Error adding livestream to wl database
CLOSED: [2024-09-03 Tue 23:59]
:LOGBOOK:
- State "FIXED"      from "BUG"        [2024-09-03 Tue 23:59]
CLOCK: [2024-09-04 Wed 01:13]--[2024-09-04 Wed 01:17] =>  0:04
:END:
[2024-09-03 Tue 23:59]

#+begin_example
  ("Failed to parse JSON" (context ())
   (json
    "{\"kind\":\"youtube#video\",\"etag\":\"M3FLZYImdyzm-o2pfeBf9-mMZZw\",\"id\":\"STYJ4IugXq0\",\"snippet\":{\"publishedAt\":\"2024-09-03T22:56:47Z\",\"channelId\":\"UCOw4v1j3QnzH7X4krQAS7fg\",\"title\":\"My Body's my Buddy Letter Writing workshop with Brye and Julia Nunes\",\"description\":\"Workshop starts at 5pm but come early for a little relaxed preshow with some live music :)\\n\\nJulia Nunes instagram.com/julianunesmusic\\nBrye instagram.com/bryemusic\",\"thumbnails\":{\"default\":{\"url\":\"https://i.ytimg.com/vi/STYJ4IugXq0/default_live.jpg\",\"width\":120,\"height\":90},\"medium\":{\"url\":\"https://i.ytimg.com/vi/STYJ4IugXq0/mqdefault_live.jpg\",\"width\":320,\"height\":180},\"high\":{\"url\":\"https://i.ytimg.com/vi/STYJ4IugXq0/hqdefault_live.jpg\",\"width\":480,\"height\":360},\"standard\":{\"url\":\"https://i.ytimg.com/vi/STYJ4IugXq0/sddefault_live.jpg\",\"width\":640,\"height\":480}},\"channelTitle\":\"Tessa Violet\",\"tags\":[\"tessa violet\",\"vlogger\",\"video blogger\",\"youtuber\",\"meekakitty\",\"original music\",\"youtube musician\"],\"categoryId\":\"22\",\"liveBroadcastContent\":\"upcoming\",\"localized\":{\"title\":\"My Body's my Buddy Letter Writing workshop with Brye and Julia Nunes\",\"description\":\"Workshop starts at 5pm but come early for a little relaxed preshow with some live music :)\\n\\nJulia Nunes instagram.com/julianunesmusic\\nBrye instagram.com/bryemusic\"},\"defaultAudioLanguage\":\"en\"},\"contentDetails\":{\"duration\":\"P0D\",\"dimension\":\"2d\",\"definition\":\"sd\",\"caption\":\"false\",\"licensedContent\":false,\"contentRating\":{},\"projection\":\"rectangular\"}}")
   (exn Not_found))
#+end_example
